Repository: mozilla-l10n/mt-training-data
Catalog: dml/dml_pontoon.tmx
Source language: en_us
Languages: dml

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
dml: جملہ تہ منظوری تہ پرئی دڇھنی بئیں سوئپ کُرا۔ مسترد کُرئیں کی کھوڜنتی بئیں سوئپ کُرا۔ وعیں کی بہ پچو بئیں سوئپ کُرا۔<strong> تانوں جائزہ جمع کُرن مہ پرموڜٹا</strong>

source: Syriac
dml: سریانی

source: Tagalog
dml: ٹیگالوگ

source: Tahitian
dml: تاہیتی

source: Taiwanese (Minnan)
dml: تائیوانی (منان)

source: Tajik
dml: تاجکی

source: Taking several attempts to read a word.
dml: ایک لفظ مترائیں کی لے پھیر کوشیش کُرن

source: Tamazight
dml: تمازائٹ

source: Tamil
dml: تامل

source: Tap
dml: ٹیپ

source: Tarifit
dml: طاری فِٹ

source: Tatar
dml: تاتاری

source: Tatoeba is a large database of sentences, translations, and spoken audio for use in language learning. This download contains spoken English recorded by their community.
dml: Tatoeba جملہ نم تہ ایک بلو ڈیٹا بیس درو،ترجمہ آں باڜہ ڇھڇئینہ استعمل بال باݜہ تہ آڈیو۔ یہ ڈوان لوڈ ۔ یہ ڈاون لوڈہ کمیونٹی کیرا باݜہ ریکاڈ کُتھین سے تھینا۔

source: Technology and Robotics
dml: ٹیکنالوجی آں روبوٹکس

source: Teke
dml: ٹیکے

source: Tell us what you'd like to download:
dml: اماکی کۡھنڈے تے تو کیہ ڈاون لوڈ کُڑن گٹنپ

source: Telugu
dml: تیلگو

source: Terms
dml: شرائط

source: <termsLink>Terms</termsLink>
dml: <termsLink>شرائط</termsLink>

source: Thai
dml: تھائی

source: Thanks for confirming your account, now let's build your profile.
dml: تاں اکاونٹ تہ تصدیق کرن تہ شکریہ، ایا تے ژا بہ تں پروفائل ژوپئمہ۔

source: Thanks to contributions from over 259k people in over 50 languages, this data is being used to train speech-enabled applications to better respond to the human voice.
dml: 50 تہ زیت باڜہ نامہ 259k ماڜ ساں تعاون تہ شکریہ،یہ ڈیٹہ انس ساں کاڻ کی ابُت جوب پریں کی تقریر تہ قابل ایپلی کیشن کی تربیت پریں کی استعمل بیاں

source: Thank you for contributing to Spontaneous Speech!
dml: بے ساختہ تقریرہ تعاون کرنہ تاں شکریہ!

source: Thank you for contributing your bulk submission!
dml: بلک جمع کُرانہ تعاون کرُنہ تا لے مہربانی

source: Thank you for contributing your voice!
dml: تانوں کاڻ پرینہ تاں شکریہ

source: Thank you for donating your voice clips!
dml: تاں کاڻ تہ کلپ عطیہ کُرن تہ پرئی شکریہ

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
dml: ریکارڈنگ تہ مہربانی<lineBreak> </lineBreak> ژاجائزہ کُری آں تانوں کلپ کُرے

source: Thank you for your information
dml: تہ معلومات تہ مہربانی

source: Thank you for your interest in contributing to { $lang }. We work hard to get every language ready for launch and keep the teams updated via email. If you want to contribute, please provide your email below.
dml: تعاون کُرنہ تاں دلچسپی گننہ مینہ شکریہ{ $lang }۔ ائی ہر باݜہ لانچ کُرنہ کی تیار کُرئیں کی محنت کُنُمہ آں ٹیم نم کی ای میل تہ زریعہ معلومات پرنُمہ اگر بی تعاون کُرن گٹنبہ بُن تانو ای میل پریا۔

source: Thank you for your voice information
dml: تاں کاڻ تہ معلومات تہ پرئی تاں مہربانی

source: Thank you! You’ve sent a new language enquiry
dml: مہربانی! تو ایک نواں باݜہ تہ انگوائری ݜئ تُھوپ

source: The best sentences are natural and conversational — they should be easy for someone to read. While phonetic diversity and different words in sentences is important, we are also trying to make recording sentences as engaging and fun for our volunteer community as possible.
dml: بہترین جملہ قدرتی آں مُشکُل بین تہ اندازہ تِھین پکار درو - تے کُرئی ایس مسو اسکانے مترین بئین. کاڻ تہ تنو آں جملہ مخلتف الفاظ لے اہم درو، ائی تانو رضاکار کمیونٹی تہ پرئی جملہ نم تہ ریکارڈنگ کتکی ایس بیاں بہ دلچسپ آں مزیدار ژوپن تہ کوشیش کُنُمہ۔

source: The best sentences for building a useful speech recognition engine are colloquial, modern parlance. Some ideas to help you generate sentences are;
dml: تقریر زانال فائدہ من انجن ژوپئیں کی بہترین جملہ نم روزانہ تہ نواں مُشکُلہ مشتمل تِھنا۔ اچھک خیالات تھا بہ میاں جملہ ژوپنہ مدد پرینا

source: The bumblebee sped by.
dml: پھٹئی شورے لٹنگا

source: The Clip Graveyard consists of voice clips that didn't make it into the Common Voice dataset. Just like the dataset, the Clip Graveyard is available for download. We would like to thank the following people and organizations for their help with the project:
dml: کاڻ تہ قبرستانہ تیں کاݩ تہ کلپ تھینا تے کیرا کاڻ ڈیٹہ سیٹہ نتین نی بئیاں۔ ڈیٹہ سیٹ گاݜٹے کاڻ تہ قبرستن ایس ڈاون لوڈ کُرئیں کی تِھنا۔ آئی میں ماش آں تنظیمونہ ساں شکریہ ادا کُنُمہ تے مسو یہ منصوبا اماں مِلی مدد کُرین

source: The clip has disrespectful or offensive language.
dml: یہ کلپہ جارحانہ آں توہین امیز بائی نم درو

source: The Common Voice Dataset contains hundreds of thousands of voice samples that help developers build voice recognition tools.
dml: کامن وائس تہ ڈیٹہ سیٹ زرگونہ لاکونہ کاڻ تہ سمپل کلپ تھینا تئیں مدد کنا ڈیویلپر کاݩ زانال اوزا ژوپیں کی

source: The community is the beating heart of Common Voice - they come from all over the world, and are language activists and scientists and artists. You can learn more about how to get involved on our <about>About</about> page and in our <community>Community playbook</community>. If you're interested in deeper organisational partnership, <emailFragment>get in touch.</emailFragment>
dml: کمیونٹی عام کاڻ تہ زادی درو، تیں سپُن دنیا تہ آڅنُن، آں میں باݜا کرم کُرال، سائنسدان آں فنکار تُھن۔ بی امونہ<about>متعلقہ پھٹ</about>آں</community>کمیونٹی پلے بُک</community> یہ شامل بین تہ طریقہ زانین بئبہ۔اگر مینا مضبوط تنظیمی شراکت داریہ دلچسپی درو بہ تاں،<emailFragment>رابطہ کُرا</emailFragment>

source: The content contains a language different than I was expecting.
dml: موادہ سے باݜہ درو،کیرا ائی توقع کُنم تا سے مختلف درو۔

source: The content has disrespectful or offensive language.
dml: یہ جملہ جارحانہ آں توہین امیز درو۔

source: The giant dino [cough] the Triassic.
dml: ٹراسک تہ لے بلو ڈاینا سور ساں [اُنداسی]

source: The giant dinosaur of the Triassic.
dml: ٹریاسک تہ لے بلو ڈاینا سور

source: The giant dinosaurs of the Triassi-.
dml: ٹریاسی تہ لے بلو ڈاینا سور نم

source: The giant dinosaurs of the Triassic.
dml: ٹریاسک تہ لے بلو ڈاینا سورنم

source: The giant dinosaurs of the Triassic. [read by one voice]
dml: ٹریاسک تہ لے بلو ڈاینا سور۔ایک کاڻہ ملی مترا

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
dml: ٹریاسک تہ لے بلو ڈاینا سور۔ایک کاڻہ ملی مترا ڈایانا سور<strong>[ایک کاڻنہ مترے]</strong>

source: The giant dinosaurs of the Triassic. Yes.
dml: آں،ٹریاسک تہ لے بلو ڈاینا سور نم

source: The giant dino <strong>[cough]</strong> the Triassic.
dml: دیو دینو<strong>[cough]</strong> ٹریاسک

source: The MediaRecorder API is not supported in your browser.
dml: تاں براوزرہ میڈیا ریکاڈر API ki ساں حمایت حاصل نی درو۔

source: The number of recordings and which languages you contribute to will be public.
dml: ریکارڈنگ تہ تعدد آں کیرا باڜہ تو معاونٹ کُنپ تیں عوامی تھیو

source: The page you are looking for could not be found
dml: تو کیرا پیج ویچینپ سے نی میلاو نی بیاں

source: There are currently no prompts for this language. Please refresh the page or try again later.
dml: یہ باݜہ تہ فی الحال کیہ اشارہ موجود نی درو تے تساں نقل کُرین یو، مہربانی کُری یہ پیج ریفریش کُرا یا آݜنتہ بپھرکی کوشیش کُرا۔

source: There are currently no sentences to review in this language.
dml: ژا یہ باڜا جائزہ کی جملہ نم نی درو

source: There are currently no transcriptions to check for this language. Please refresh the page or try again later.
dml: یہ باݜہ دڇھئیں کی فی الحال ورے نقل نی درو۔ مہربانی کُری پیج ریفریش کُرا یا آݜنتہ پھرکی کوشیش کُرا۔

source: There are lots of ways to think about language. For the purposes of speech recognition models, Common Voice suggests focussing on ‘mutual intelligibility’, or ‘can speakers of this language mostly understand one another if they try to?’
dml: باݜہ تہ بارہ سوج کرئین کی لے پھن درو، مُشکُل زانن تہ ماڈلنم تہ مقصد ت پرئی کامن وائس تجویز کُنا ، تانومانہ زاننہ توجو کُرا یا یہ باݜہ پریال لے ایک سیک پوئی بین کوشیش کُنُن نی

source: The recording was too long.
dml: ریکاڈنگ لے دریگہ تھاتا

source: The recording was too quiet.
dml: ریکاڈنگ لے کمزور تھاتا

source: The recording was too short.
dml: ریکاڈنگ لے اُوچھوٹی تھاتا

source: There is currently no audio to transcribe for this language. Please refresh the page or try again later.
dml: یہ باݜہ تہ فی الحال کیہ آڈیو موجود نی درو تے تساں نقل کُرین یو، مہربانی کُری یہ پیج ریفریش کُرا یا آݜنتہ بپھرکی کوشیش کُرا۔

source: There should ideally be no digits in the source text because they can cause problems when read aloud. The way a number is read depends on context and might introduce confusion in the dataset. For example, the number “2409” could be accurately read as both “twenty-four zero nine” and “two thousand four hundred nine”.
dml: بہتر یہ درو تے سورس متنہ اعداد مہ تھیبو کوئی تے میں شورے مترنہ مسئلہ پیدا کُنا۔ عدد ساں مترن تہ طریقہ سیاق و سباقہ مشتمل تِھنا آں یہ ڈیٹا سیٹہ اُلھاو پیدا کُنا۔ مثل تہ طورہ عدد “2409” سئی طریقہ “بشی او چور صفر نو” آں “دو زرہ چور سوہ آں نو”. دوئیں طریقہ مترین بئیبہ۔

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
dml: مترال منورہ کاڻ تہ قدرتی طورہ ایک سیک تہ بدل تِھنا. صرف یہ صورتہ مسترد کُرا تے کاڻ متکی زیت تھیو تہ ریکارڈنگ چھیو یا (عام طورہ ) تہ کاڻ متکی بیݜ تھیو تہ بی متن تہ مدد تہ بغیر یہ اُشتُرونین نی بئبہ تے کیہ گنا۔

source: The route was unclear.
dml: پھن واضح نی تھا

source: These languages are currently under community development. <localizationGlossaryLink>Website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink> is needed to launch.
dml: میں باݜہ نم یہ ٹیمہ کمیونٹی ترقی تہ تحت درو۔<localizationGlossaryLink>ویب لوکلائزئیشن</localizationGlossaryLink>آں<sentenceCollectionGlossaryLink>جملہ سوتن</sentenceCollectionGlossaryLink> لانچ کُرن تہ ضرورت درو۔

source: The selected file is too large
dml: سلیکٹ کُریسن فائل لے زیت بلو درو

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
dml: جملہ نم جمع کُرال بنیادی عام کاڻ تہ پلیت فامہ کی منتقل بیاں، ژا بی ایک جملہ لیکین بئینبہ آں ایک جملہ ساں جائزہ ڜئین بئنبہ عام کاڻہ

source: The sentence has a grammatical or spelling error.
dml: یہ جملہ گرائمر آں املا تہ غلطی درو

source: The sentence has disrespectful or offensive language.
dml: یہ جملہ جارحانہ آں توہین امیز درو

source: The sentence must be grammatically correct.
dml: جملہ گرائمر تہ لحاطہ سئی تھیبو

source: The sentence must be speakable.
dml: جملہ کھنڈن تہ قابل تھیبو

source: The sentence must be spelled correctly.
dml: جملہ تہ املا سئی تھیبو

source: The sentence should have fewer than 15 words.
dml: ایک جملہ 15 الفاظ تہ کم تھیبو

source: The site is ready to be launched when it reaches 75% completion.
dml: کیر 75% کرم با بہ یہ سائٹ لانچ کُرئں کی تیار درو

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
dml: یہ سائٹ ساں لے پھتائی بیک اپ گین یو۔ تازہ ترین معلومات تہ پرئی شامل با <matrixLink>میٹرکس کمیونٹی چیٹ</matrixLink>یا دڇھا<githubLink> GitHub </githubLink> آں<discourseLink> امونہ ڈسکورس فورم نم </discourseLink> سائٹ تہ تجربہ تہ مسائل جمع کُرن آں تسونہ نگرانی کی

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
dml: TED-LIUM کارپس آڈیو ٹاک آں TED ویب سائٹہ موجود تسونہ نقل تہ ژوپائیسن درو

source: The website text is translated into that language.
dml: سے باݜا ویب سائٹ تہ متن تہ ترجمہ با

source: This content contains personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
dml: یہ مواد ایک فرد ساں شناخت تہ متعلق زاتی طورہ شناخت کُرال معلومات درو، لکہ مساں نم،ای میل تہ پتہ،، تھانہ، شناختی نمبر، یا بہ فون نمبر۔

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
dml: یہ معلومت پرین اختیاری درو- تو صرف مس شامل کُرے کیر تو کی اسکان تھابہ۔ کیر ائی ڈیتہ سیت کُرومہ بہ تہ ائی زاتی معلومات تہ تخلص کُنُمہ آں یہ بائی یقینی کُنُمہ تے تاں نم ای میل دے منو معلومات آبادیاتی معلومات عمر آں جنس ملی شریک نی تِھیو

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex. For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. Learn more about why metadata matters.
dml: یہ معلومت پرین اختیاری درو- بی تگہ شامل کُرا تے بی کیرمیاکی سکون تھا بہ۔۔ کیر ائی ڈیٹا سیٹ جاری کُنُمہ، تا ائی تمم ذاتی معلومت گمنام کُنُمہ، آں یہ باتی یقینی ژوپائیمہ تے مینہ نام، ای میل، عمریا جنس ساں معلومت جغرافیائی معلومت ملی منسلک نی تھیو۔

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
dml: یہ ایک استعملہ کیسہ چلال طبقہ دروسے کھنڈیسن ہندسہ ساں زانن آں/ نی تہ پتہ لگئیں ڈیٹا تِھنا

source: This is how you cite yourself if you wrote the content yourself.
dml: اگر تو تانئی مواد لیکی تُھوپ بہ تو منے کُری حوالہ پرنبہ

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
dml: یہ ترتیب تاں لیڈر بورڈ ساں نمائش کنٹرول کُنا۔ کیر ویلئن گا بہ تاں پیش رفت زاتی تھیو۔ مساں یہ مطلب با تے تاں فوٹو، استعمل کُرال ساں نام آں پیش رفت لیڈر بورڈہ نی ژاپوں۔ نوٹ کُرا تے لیڈر بورڈہ تبدلی ظاہر کُرنہ منٹ نم { $minutes } لگیا۔

source: Three to go!
dml: تَرا اوتھینا

source: Tibetan
dml: تِبتی

source: Tigre
dml: ٹائیگر

source: Tigrinya
dml: ٹگرینیا

source: To change or edit your email, send us an email to <emailFragment>commonvoice@mozilla.com</emailFragment>
dml: ای میل بدَلن یا ترمیم کُرئں کی اماں کی ای میل کُرا

source: Today
dml: مُدے

source: Today's Common Voice progress on clips recorded
dml: ریکارڈ کُرٰسن کلپہ مُدیوکہ پیش رفت

source: Today's Common Voice progress on clips validated
dml: کلپہ مُدیوکہ پیش رفت ساں توثیق با

source: Today's Progress
dml: مُدِیوکہ رپورٹ

source: Toki Pona
dml: ٹوکی پونا

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
dml: کامن وائس تہ ڈیٹہ سیٹہ کاڻ تہ کلپ نتئیں کی، دوپوگلہ باݜہ پریال ساں توثیق کُرن ضروری درو

source: Too many files
dml: لے زیت فائل نم

source: Top Contributors
dml: سپُن تہ لے تعاون کُرال

source: Total
dml: ٹوٹل

source: Total Approved
dml: سپُن منظور بئی سن

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
dml: دڇھنی بئیں ائی فائدہ تہ خاکہ پیش کُنُمہ آں ائی واضح کُنُمہ تے ائی کیہ قسم تہ معلومات عام کُرن گٹینُمہ۔ تانو آلہ عام کاڻ تہ اکاونٹہ ملی شروع کُرئیں کی بُن پرئی سن لنک ساں استعمل کُرا

source: Toward next goal
dml: مُکھ بئں تہ مقصد بئں

source: Track progress here and on your stats page.
dml: ایا آں اعداد و شمار تہ تانوں پھٹہ پیش رفت ٹریک کُرا

source: Transcribe
dml: ٹرانسکرئب / نقل کُرا

source: Transcribe Audio
dml: آڈیو نقل کُرے

source: Transcribe audio recordings into text
dml: آڈیو ریکارڈنگ متنہ نقل کُرا

source: Transcribe audio recordings in your language
dml: آڈیو رککارڈنگ تانوں باڜہ نقل کُرا

source: Transcribe Audio <small>(Coming soon)</small>
dml: آڈیو ساں نقل کُرے<small>(پھتائی آڅنا)</small>

source: Transcript edited successfully
dml: نقل کامیابی ݜا ایڈیٹ با

source: Transcript skipped successfully
dml: نقل کامیانی ݜا وعین گا

source: Transcript submitted successfully
dml: نقل کامیابی ݜا جمع کُرین گا

source: Transcript voted successfully
dml: ٹرانسکرپٹ کی کامیابی ݜا ووت پرین گا

source: Transgender
dml: ہیجڑا

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
dml: امونہ گائیڈ داڇھآ تے پوتون کنو کُری استعمل کُرِبہ

source: Translating the site
dml: سائٹ ساں ترجمہ کرن

source: Translation is from English, but you can see <strong>Suggestions</strong> in other languages. Click the <strong>Profile</strong> icon, then <strong>Settings</strong> link and add any languages you speak. At the bottom right-hand corner will be a list of translations called <strong>Locales</strong>. Translations show on the site after one day.
dml: ترجمہ انگریزی تہ کُرن درو، لیکن بی دڇھین<strong> مشورہ </strong> بئیبہ ورے باݜا نامہ، کلک کُرا<strong> پروفائل </strong>آئیکون، پھرکی <strong>سیٹنگ </strong>لنکہ آں پھرکی کیہ ایس باݜہ نم بی پرِنبہ سے شامل کُرا۔ دڇھنی طرفہ ٹوپہ ایک لسٹ تھیو ترجمہ تہ <strong> لوکلز</strong> تہ نامہ۔ ترجمہ سائٹہ ایک دیو آݜنتہ کڅین یِنا

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
dml: عام کاڻ تہ سائٹ تہ ترجمہ Pontoon نہ بیاں

source: Try again by dragging your file here
dml: رانو فائل ایا کی کھݜائی پھرکی کوشیش کُرا

source: Try uploading again
dml: دوبارہ اپ لوڈ کُرن تہ کوشیش کُرا

source: Tshivenda
dml: شیوینڈا

source: Tunen
dml: ٹونین

source: Tupuri
dml: ٹوپوری

source: Turkish
dml: ترکی

source: Turkmen
dml: تُرکمانستانی

source: Tuvan
dml: ٹوان

source: Twi
dml: ٹوئی

source: Typically megabytes
dml: عام طورہ میگا باٹس

source: Ubykh
dml: اُبیخ

source: Udmurt
dml: اُدمُرت

source: Ukrainian
dml: یوکرینی

source: Understand contribution criteria
dml: شراکت تہ معیار زانا

source: Understand how to contribute and validate sentences and audio clips to the Common Voice dataset
dml: عام کاڻ ڈیٹا سیٹہ جملہ نم آں آڈیو کلپ نم تہ تعاون آں توثیق کُرن تہ طریقہ زانا

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
dml: یہ زانا تے کاڻ تہ کلپ اُشتروننہ کیہ شئی نامہ ساں دھین کُرم بݜ درو آں تانوں کاڻ تہ ریکارڈنگ ورے ایس بہتر کُرا۔

source: Universities, Academics and Researchers
dml: یونیورسٹی نم، تعلیمی آں تحقیق کُرال

source: Upload aborted. Do you want to delete your recordings?
dml: اپ لوڈ اوتھینا۔ تو ریکارڈنگ ڈیلیٹ کُرن گٹینپی

source: Upload an image file
dml: فوٹو تہ فائل اپ لود کُرا

source: { $uploadedSentences } of { $totalSentences } sentences collected
dml: { $uploadedSentences } ساں { $totalSentences } جمع با

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
dml: { $uploadedSentences } ساں { $totalSentences } جملہ نم جمع با۔ کلک<downloadLink> ایا </downloadLink>مسترد بئی سن جملہ نم ڈون لوڈ کُرئیں کی۔

source: Upload failed, please retry.
dml: اپ لوڈ ناکم با، مہربانی کُری دوبارہ کوشیش کُرے

source: Upload <icon></icon> public domain sentences
dml: اپ لوڈ<icon> </icon>عوامی ڈومین تہ جملہ نم

source: Upload in progress...
dml: اپ لوڈ جاری درو

source: Upload more sentences?
dml: ورے جملہ نم اپ لوڈ کُرے

source: Upload of this clip keeps failing at server. Reload the page or try again later.
dml: یہ کلپ سرورہ اپ لوڈ نی بیاں، پھٹ بپھرکی اپ لوڈ کُرا یا بہ آڜنتہ کوشیش کُرا

source: Upload of this clip keeps failing, keep retrying?
dml: یہ کلپ تہ اپ لوڈ نی بیاں، بپھرکی کوشیش جاری ساتے

source: Urdu
dml: اردو

source: Use correct grammar
dml: سئی گرائمر استعمل کُرا

source: Use correct spelling and punctuation
dml: سئی ہجہ آں اوقاف تہ استعمل کُرا

source: Useful for <mark>organic speech contexts</mark> and use cases (eg, when you want speech recognition to work with people speaking unscripted and colloquially)
dml: فائدہ مند کی<mark> نایاتی تقریعر تہ سیاق و سباق</mark> آں مقدمات تہ استعمل کُرا (مثل تہ طورہ ، کیرا بی گٹینبہ تے تقریر زاناال تئیں مااݜہ ملی کُرو تے کُرئی غیر اسکرپٹ آں بول چال مُشکُل بین)

source: User Name
dml: استعمل کُرل ساں نم، یوزر نیم

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
dml: استعمل کرال مئی پریسن کلپ تہ توثیق کنُن، یہ زانی تے مُشکُل بالے سئی مَترِتھے

source: Uyghur
dml: ایغور

source: Uzbek
dml: اُزبک

source: Validated Clips
dml: تصدیق کُریسن کلپس نم

source: Validated Hours
dml: تصدیق کُریسن گھنٹہ نم

source: Validated Hr. Total
dml: سپُن تصدیق بئیسن ایج آر

source: Validate Readings
dml: مترن تہ توثیق کُرا

source: Validate Readings, Review Transcriptions
dml: مترن تہ توثیق کُرا، نقل نم تہ جائزہ کُرا

source: Validate readings submitted by community members
dml: کمیونٹی ممبران ساں طرف تہ جمع کُریسن ریڈینگ ساں توثیق کُرا

source: Validate user-recorded readings in your language
dml: تانوں باڜا صارف ساں ریکارڈ کُریسن مترن ساں توثیق کُرا

source: Validating donated clips is equally important to the Common Voice mission. Take a listen and help us create quality open source voice data.
dml: عام کاڻ تہ مشین کی عطیہ کُریسن کلپ نم ساں تصدیق ضروری درو۔ اُشترونا آں میعاری اوپن سورس کاڻ تہ ڈیٹا ژوپنہ امونہ مدد کُرا

source: Validation Progress
dml: توثیق تہ عمل

source: Validations
dml: توثیق نم

source: Value and recognition.
dml: قدر آں زانن

source: Variant Contribution Options
dml: ویریئنٹ حصہ تہ اپشنز

source: Variants are a specific form of a language - for example shared by those living in a geography or commmunity. Sometimes these are called dialects.
dml: ویریئنٹ باݜہ ساں ایک مخصوص شکل درو- مثلا جغرافیہ یا کمیونٹی تھیا ل ماݜ منورہ مشترکی تھیو۔ بعض ٹیمہ مسوکی بولیاں ایس گنُن۔

source: Varying Pronunciations
dml: مختلف تلفظ

source: Venetian
dml: وینیشین

source: Version
dml: ورژن

source: Very common mistakes include:
dml: لے عام غلطی نم شامل درو

source: Vietnamese
dml: ویتنامی

source: View your progress against personal and project goals.
dml: تانوں پیش رفت ذاتی آں پراجیکٹ تہ اہداف تہ مقابلہ دڇھا

source: Visible
dml: اخکارہ

source: Visit our blog or write about us
dml: امونہ بلاگہ کی یت یا بہ امونہ بارہ لیکے

source: Voice clips are entered into a submission queue that readies them for listening.
dml: کاڻ تہ کلپ نم ایک جمع کُرال قطارہ نتینن ینا سے تسو اُشتُرنئں کی تیار کُنا

source: Voice Collection
dml: کاڻ سوتن

source: Voice Contribution
dml: کاڻ تہ مدد

source: Voice Dataset, Ready for Download
dml: کاڻ تہ ڈیٹہ سیٹ، ڈاون لوڈ کی تیار درو

source: Voice is natural, voice is human. That’s why we’re excited about creating usable voice technology for our machines. But to create voice systems, developers need an extremely large amount of voice data.
dml: کاڻ قدرقی درو، کاڻ انسانی درو۔ یہ تہ پرئی ائی تانوں مشین نامہ کی قابل استعمل کاڻ تہ ٹیکنالوجی ژوپئیں کی پُر جوش تُھومہ۔ مگر کاڻ تہ سسٹم ژوپئیں کی ڈویلپرز کی لے زیت کاڻ تہ ضروت تِھنا۔ ڈیٹا۔

source: Voice is natural, voice is human. That’s why we’re fascinated with creating usable voice technology for our machines. But to create voice systems, an extremely large amount of voice data is required.
dml: کاڻ قدرتی درو، کاڻ انسانی درو۔ یہ تہ پرئی قابل استعمل کاڻ ژوپنہ دلجچپی ساتِنومہ۔ امونہ مشین نامہ کی۔ کاڻ تہ سسٹم ژوپائیں کی، کاڻ تہ لے زیت ڈیٹہ دہ ضرورت تِھنا۔

source: Voices Online Now
dml: اواز نم ژا آن لائن

source: Voice Validation
dml: کاڻ تہ توثیق

source: Volume
dml: حجم

source: Votic
dml: ووٹک

source: VoxForge was set up to collect transcribed speech for use with Free and Open Source Speech Recognition Engines.
dml: VoxForge مئی آں اوپن رریعہ تقریر زانال انجن نم ملی استعمل کُرئیں نقل کُریسن تقریر جمع کُرئیں ژوائیسن درو
